// Задача 13. Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.


// string str = Convert.ToString(new Random().Next(0,100000));
string numbers = Console.ReadLine();
// Console.WriteLine(numbers);

void ThirdNumber(string number) // 0 1 2 3 4 5 
{
    int index = 0;
    string [] str = {};
    while(index < 3)
    {
       // if (number[index] == str[0])
        {
            Console.Write("No");
        }
        index++;

    }
}
// ThirdNumber(numbers);
string[] nole = {};
Console.Write(nole);
// int index = 2;
//if (numbers[index] == nole[0]) 
