//Задача 10. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру числа.

string stringNumber = Console.ReadLine();

Console.Write(stringNumber[1]);